karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
/*reg addr end*/

typedef unsigned char BYTE;

typedef BYTE KARRI_BOOL;

typedef enum {
            IDLE,
            LISTENING,
            PEER_CONNECTED,
            REQUEST_RECEIVED,
            PARSE_REQUEST,
            SEND_RESPONSE
} mainserverSM;

/*Static */

/*static const saves it in the program memory, not RAM*/

static const BYTE get_cmd[] = "GET /index.htm";

static const BYTE website_template[] =

"HTTP/1.1 404 Not Found \
Date: Sat, 10 May 2014 08:54:23 GMT \
Server: Apache/2.2.22 (Ubuntu) \
Vary: Accept-Encoding \
Content-Length: 291 \
Content-Type: text/html; charset=iso-8859-1 \
<!DOCTYPE HTML PUBLIC \"-//IETF//DTD HTML 2.0//EN\"> \
<html><head> \
<title>404 Not Found</title> \
</head><body> \
<h1>Not Found</h1> \
<p>The requested URL /index.htm was not found on this server.</p> \
<hr> \
<address>Apache/2.2.22 (Ubuntu) Server at www.karrikivela.fi Port 80</address> \
</body></html> \
";


/*Globals*/
short g_portc = 0;


int g_rx_sock0_mask;
int g_rx_sock0_base;

int g_rx_sock1_mask;
int g_rx_sock1_base;

int g_tx_sock0_mask;
int g_tx_sock0_base;

int g_tx_sock1_mask;
int g_tx_sock1_base;

int g_mainSM_state = IDLE;

/*Macros for turning LEDs on*/
#define LED1_ON() \
  do { \
    g_portc |= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_ON() \
  do { \
    g_portc |= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_ON() \
  do { \
    g_portc |= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_ON() \
  do { \
    g_portc |= 0x08; \
    PORTC = g_portc;\
  } while (0)

/*Macros for turning LEDs off*/
#define LED1_OFF() \
  do { \
    g_portc &= 0xFE; \
    PORTC = g_portc;\
  } while (0)

#define LED2_OFF() \
  do { \
    g_portc &= 0xFD; \
    PORTC = g_portc;\
  } while (0)

#define LED3_OFF() \
  do { \
    g_portc &= 0xFB; \
    PORTC = g_portc;\
  } while (0)

#define LED4_OFF() \
  do { \
    g_portc &= 0xF7; \
    PORTC = g_portc;\
  } while (0)

#define RESET_LOW() \
  do { \
    PORTCbits.RC4 = 0; \
  } while (0)

#define RESET_HIGH() \
  do { \
    g_portc = PORTC;\
    g_portc |= BIT4;\
    PORTC = g_portc;\
  } while (0)


/*SPI macros*/
#define CS_ASSERT() \
  do { \
    PORTCbits.RC6 = 0; \
  } while (0)

#define CS_DEASSERT() \
  do { \
    PORTCbits.RC6 = 1; \
  } while (0)


#define DELAY_BETWEEN_COMMANDS() delay(5000)

#define SPI_SYNC_TX_BYTE(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
    } while(0)


#define WIZNET_WRITE(addr, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);\
        SPI_SYNC_TX_BYTE(addr & 0x00FF);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)

inline unsigned char
wiznet_read(unsigned int addr)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(READ_OPCODE);
    SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);
    SPI_SYNC_TX_BYTE(addr & 0x00FF);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}



inline KARRI_BOOL compare_buffers(BYTE *eth_buff, BYTE *cmd, unsigned int size)
{
    KARRI_BOOL ret_status = KARRI_OK;
    int x;
    for(x=0;x<size;x++)
    {
        if(eth_buff[x] != cmd[x])
        {
            ret_status = KARRI_NOK;
            break;
        }
    }

    return ret_status;
}


typedef unsigned char DEBUG_MSG;
#ifdef UART_DEBUG
inline void debug_print(DEBUG_MSG *msg)
{
    int x;
#if 1
    for(x=0;x<MAX_UART_PRINT_LENGTH;x++)
    {
        if(msg[x] == '\n') //break character
        {
            break;
        }

        while(!TXSTAbits.TRMT);

        TXREG = msg[x];
    }

    while(!TXSTAbits.TRMT);
    TXREG = 0x0A;
    while(!TXSTAbits.TRMT);
    TXREG = 0x0D;
#endif
#if 0
    for(x=0;x<10;x++)
    {
        TXREG = 0x31 + x;
        while(!TXSTAbits.TRMT);
    }
#endif
}
#else
inline void debug_print(DEBUG_MSG *msg)
{
    _nop();
}
#endif //UART_DEBUG


/*Configuration bits*/
#pragma config CPD      = OFF
#pragma config BOREN    = ON
#pragma config IESO     = OFF
#pragma config FOSC     = HS //No need to consider power consumption
#pragma config FCMEN    = ON
#pragma config MCLRE    = ON //need to check
#pragma config WDTE     = OFF
#pragma config CP       = OFF
#pragma config PWRTE    = ON
/**/

/********************************************/
/*Implementations*/


void delay(unsigned int count)
{
    unsigned int x;
    for(x=0;x<count;x++)
    {
        _nop();
    }
}

void wiznet_read_bytes(unsigned int chip_addr, BYTE *rx_buff, unsigned int len)
{
    int x;
    for(x=0;x<len;x++)
    {
        rx_buff[x] = wiznet_read(chip_addr);
        chip_addr++;
    }
}


void wiznet_write_bytes(unsigned int chip_addr, BYTE *tx_buff, unsigned int len)
{
    int x;
    for(x=0;x<len;x++)
    {
        WIZNET_WRITE(chip_addr, tx_buff[x]);
        chip_addr++;
    }
}


// SDI - RB4
// SDO - RC7
// SCL - RB6
// SS  - RC6
/*Write & read test byte*/
short test_wiznet_connection(void)
{
    short conn_status = KARRI_NOK;
    unsigned char rxByte = 0;


    //We use here register REG_GATEWAY_IP3 for testing write & read of the CHIP
    WIZNET_WRITE(0x0004, TEST_BYTE);

    rxByte = wiznet_read(0x0004);

    WIZNET_WRITE(0x0004, 0x00);

    if(rxByte == TEST_BYTE)
    {
        conn_status = KARRI_OK;
    }
    else
    {
        conn_status = KARRI_NOK;
    }

    return conn_status;
}


/*
 *
 * Basic Setting
For the W5100 operation, select and utilize appropriate registers shown below.
1. Mode Register (MR)
2. Interrupt Mask Register (IMR)
3. Retry Time-value Register (RTR)
4. Retry Count Register (RCR)
For more information of above registers, refer to the ?Register Descriptions?.
 *
 *
 * Setting network information
Below register is for basic network configuration information to be configured according to
the network environment.
1. Gateway Address Register (GAR)
2. Source Hardware Address Register (SHAR)
3. Subnet Mask Register (SUBR)
4. Source IP Address Register (SIPR)
The Source Hardware Address Register (SHAR) is the H/W address to be used in MAC layer, and
can be used with the address that manufacturer has been assigned. The MAC address can be
assigned from IEEE. For more detail, refer to IEEE homepage.
 *
 *
 * Set socket memory information
This stage sets the socket tx/rx memory information. The base address and mask address of
each socket are fixed and saved in this stage.
 *
 Example (abstract):
 {
 RMSR = 0x55; // assign 2K rx memory per socket.
gS0_RX_BASE = chip_base_address + RX_memory_base_address(0x6000);
gS0_RX_MASK = 2K ? 1 ; // 0x07FF, for getting offset address within assigned socket 0 RX
memory.
gS1_RX_BASE = gS0_BASE + (gS0_MASK + 1);
gS1_RX_MASK = 2K ? 1 ;
gS2_RX_BASE = gS1_BASE + (gS1_MASK + 1);
gS2_RX_MASK = 2K ? 1 ;
gS3_RX_BASE = gS2_BASE + (gS2_MASK + 1);
gS3_RX_MASK = 2K ? 1 ;
TMSR = 0x55; // assign 2K tx memory per socket.
Same method, set gS0_TX_BASE, gS0_TX_MASK, gS1_TX_BASE, gS1_TX_MASK,
gS2_TX_BASE, gS2_TX_MASK, gS3_TX_BASE and gS3_TX_MASK.
 }
 *
 *
 *
 */
void init_wiznet(void)
{
    /**GENERAL NETWORK STACK CONFIGURATION**/
    //Set IMR -  all interrupts as masked 
    WIZNET_WRITE(REG_INTERRUPT_MASK,0x00);
    DELAY_BETWEEN_COMMANDS();

    //RTR default (200ms) no need to change currently
    //RCR default (8) no need to change currently

    /**IP LEVEL CONFIGURATION**/
    //No space/time for DHCP server code, setting options currently as fixed!
    //GWR register - gateway IP address 10.0.0.138
    WIZNET_WRITE(REG_GATEWAY_IP0,0x0A); //10
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP1,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP2,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP3,0x8A); //.138
    DELAY_BETWEEN_COMMANDS();

    //SUBR register - subnet mask 255.255.255.0
    WIZNET_WRITE(REG_SUBNET_MASK_IP0,0xFF); //255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP1,0xFF); //.255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP2,0xFF); //.255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP3,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    //SAHR register - MAC address CA:CA:CA:FE:BA:BE
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC0,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC1,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC2,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC3,0xFE); //FE
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC4,0xBA); //BA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC5,0xBE); //BE
    DELAY_BETWEEN_COMMANDS();
    //SIPR register - device IP address 10.0.0.77
    WIZNET_WRITE(REG_SOURCE_ADDR_IP0,0x0A); //10
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP1,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP2,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP3,0x4D); //.77
    DELAY_BETWEEN_COMMANDS();

